{
  "Mixers And Grinder": {
    "Bajaj Rex 750W Mixer Grinder with Nutri Pro Feature, 4 Jars, White": {
      "price": 2899,
      "rating": 3.8,
      "seller": "Cloudtail India",
      "description": "750 Watts mixer grinder with multi-function blade\nAttractive 4 jars with a capacity of 1.8L, 1.5L, 1L and 0.4L\nABS material with vibrant color\nIt comes with Titan Motor\n1 year product warranty\n",
      "createdOn": "2021-10-14T03:27:47.671Z"
    },
    "Butterfly Jet Elite Mixer Grinder, 750W, 4 Jars (Grey)": {
      "price": 2599,
      "rating": 3.9,
      "seller": "Cloudtail India",
      "description": "Wattage: 750 W; Voltage: 220-240V, 50-60Hz ; Revolution: 18500\nNo of Jars: 4; Jar Size: 0.4,0.75,1 in Ltr; Jar Material: Stainless Steel jars and PC Juicer Jar; Body Material: ABS body; Cord Material: 180 CM; Blade Material: Stainless Steel; Speed Control: 3 Speed motor for faster and efficient grinding.Body: Body made of ABS which is shock free\nDo not worry if you experience some burning smell when you run your mixer grinder for the 1st time .This is due to the motor varnish getting heated for the 1st time. The problem should not recur in subsequent uses. If it does, please contact Brand Service Centre\nRead Manual Before Use\nPowerful motor, Auto Switch Off: Yes; Aesthetically designed ABS body. Body made of ABS which is shock free\nElegant handle and unbreakable lid; Special ventilator to reduce motor heating. Coupler: Special grade Nylon couplers used for better durability\nIncludes: Mixer Grinder, Juicer jar, Liquid jar with lid, Dry jar with lid, Chutney jar with Lid, Spatula and User manual with Warranty Card",
      "createdOn": "2021-01-14T03:17:47.671Z"
    },
    "Bajaj Rex 500W Mixer Grinder with Nutri-Pro Feature, 3 Jars, White": {
      "price": 1899,
      "rating": 4.2,
      "seller": "Cloudtail India",
      "description": "Wattage: 500 W; Voltage: 220-240V ; Revolution: 20000\nNo of Jars: 3; Jar Size: 1.20 Litre liquidizing jar, 0.8 Litre multi purpose jar, 0.3 Litre chutney jar; Jar Material: Stainless Steel; Body Material: ABS; Cord Material: PVC; Blade Material: Stainless Steel; Speed Control: 3 speed control with incher for momentary operation\nDo not worry if you experience some burning smell when you run your mixer grinder for the 1st time .This is due to the motor varnish getting heated for the 1st time. The problem should not recur in subsequent uses. If it does, please contact Brand Service Centre; Since your mixer grinder runs on a powerful motor, there will be some noise. If the noise level seems abnormal, please contact Brand Service Centre\nSince your mixer grinder runs on a powerful motor, there will be some noise, if noise level seems to be abnormal then please contact brand customer support team; Do not worry if you experience some burning smell when you run your mixer grinder for the 1st time\nSturdy stainless steel jars for liquidizing , wet/dry grinding and chutney making\nEasy grip jar handles\nMulti-functional blade system. Elegant body design",
      "createdOn": "2021-01-14T03:17:47.671Z"
    }
  },
  "Hand Blenders": {
    "PHILIPS HL1655 250W Hand Blender ( White)": {
      "price": 1297,
      "rating": 4.2,
      "seller": "Cloudtail India",
      "description": "Steel Rod, Rust Proof metal rod for hot/cold blending. The voltage is 230 volts and the RPM is 18000 rpm\nCord length : 1.2 m and Power 250 W\n2 years Warranty\n20 minutes blending of Hot & Cold Dishes\nRemovable blades for whisking & Whipping\nLength of the Product:13 Inches, Frequency: 50 Hz\nEasy Clean,Wall bracket for easy storage",
      "createdOn": "2021-01-14T03:17:47.671Z"
    }
  },
  "Food Proessor": {
    "SATVAT Manual Food Processor - Chopper, Blender, Atta Maker, Dough maker, Dough Kneader,14 Pieces (Multicolor)": {
      "price": 699,
      "rating": 2.2,
      "seller": "SATVAT",
      "description": "Material: Unbreakable Plastic Colour: Multicolor, Made In India Dimension of the main container is 18 x14x 8 cm.\nAnyone can produce perfect results quickly and easily. There is no skill involved, no strength required, and no complicated steps to learn. Egg white separator, storage lid, slicer, julienne, and shredder inserts.\nManual food processor geared towards high performance chopping, mincing, slicing and more! A kitchen powerhouse for successful cooking preparations. 10x faster than cutting with a knife.\nPackage Contents: 1 Body, 9 Blades, 3 Measuring Bowl and 1 Plate.",
      "createdOn": "2021-01-14T03:17:47.671Z"
    }
  },
  "Oven Toaster Grills": {
    "Philips HD6975 25 Litre Digital Oven Toaster Grill, Grey, 25 liter": {
      "price": 6999,
      "rating": 4.4,
      "seller": "Cloudtail India ",
      "description": "Capacity: 25 litres, s for 4-5 people\nCooking capability: baking, grilling, toasting\nPowerful 1500W, Ready signal\nOpti temp technology(Even Browning)\nOne touch 10 preset menu\nOne-touch Preheat functionality\nIncludes Oven toaster grill,Baking Tray, Grill Rack, Tong, Crumb Tray and Skewer Rods",
      "createdOn": "2019-01-14T03:17:47.671Z"
    },
    "CARTSHOPPER Household automatic toaster 2 slices sandwich breakfast machine baking cookingToaster 2 Slice, Extra-Wide Toaster, Stainless Steel Toaster, Evenly Toast": {
      "price": 678,
      "rating": 4.3,
      "seller": "Cloudtail India ",
      "description": "[Unique Designed Stainless Steel Toaster] The toaster looks sleek and adds a sense of nobility to your kitchen. With the Stainless Steel internally and externally, this toaster is absolutely safe for your families’ health. Unlike other plastic toasters, the metal housing guarantees it toast without foul smell.\n[Make Perfect Breakfast in a Few Minutes] 6 Bread Shade Settings. Automatic evenly fast toasting. The Cotomier 2 slice toaster quickly and consistently browns your bread perfectly for both sides, top to bottom.\n[Removable Crumb Tray and Convenient Cord Wrap] The slide-out crumb tray, easily pulled out from the bottom of the toaster, is intended for quick and simple cleanup of crumbs and debris. The toaster also has a cord wrap to manage the power cords invisibly when you need to store it.\n【Easy to clean】Pull out the removable crumb tray (located on the back of the toaster) to quickly clear the crumbs that have accumulated on the bottom of the toaster.",
      "createdOn": "2019-01-14T03:17:47.671Z"
    }
  },
  "Kettle & Toaster Sets": {
    "Pigeon Ebony Double Walled Cool Touch Stainless Steel Electric Kettle, 1.8 Litre, with 1500 Watt, boiler for Water, milk, tea, coffee, instant noodles, soup etc (Black), Large": {
      "price": 899,
      "rating": 4.4,
      "seller": "Cloudtail India ",
      "description": "PRECISE AND FAST: Pigeon Ebony Double Walled Stainless Steel Electric Kettle can boil water faster than stovetop. Now make Herbal Tea or instant soups without hassle\nCordless Servings: Detaches from base for convenient cordless serving with a heat-proof plastic handle\nSturdy Stainless Steel Design: Ebony Electric Kettle Stainless steel 1.8 liter with 1500 watt electric kettle for quickly boiling water with handy cord wrap system for space-saving storage with 3.5mm thick inner pot\nAuto Shut Off: The electric kettle will automatically shut off when water boils and its boil dry protection feature will provide years of dependable use\nCapacity: With a generous 1.8 Liter water capacity, the electric kettle will heat ample amounts of water for hot beverages and effortless food preparation\nWarranty: 1 year Warranty from the brand\nPower: 1500 watt; Operating Voltage: 220-240 volts\nPackage Includes: Ebony Double walled Stainless Steel Kettle and User Manual",
      "createdOn": "2019-01-14T03:17:47.671Z"
    },
    "Hafele Queen - Electric Stainless Steel Kettle, Tea and Coffee Maker with Removable Lime Scale Filters for Easy Cleaning, Quick, Efficient Boiling with Analogue Temperature Display, 1.6 Litre, White": {
        "price": 6499,
        "rating": 4.5,
        "seller": "E-Retail-Inc ",
        "description": "2150 Watt Powerful Electric Kettle\nUK Strix Control for precise heating and Analog temperature display\nThe detachable fine mesh filters found in the spout of the Queen Kettle restrains all pieces of limescale in the kettle from being poured into your drink\nExternal Water Gauge, Automatic & Manual Switch Off\nBoil-Dry Protection - This safety feature, integrated in the Queen Kettle, cuts-off the power when it senses that there is no water left in the kettle or the water level is below the minimum level required (i.e. 0.7 L) and UK thermostat etc",
        "createdOn": "2019-01-14T03:17:47.671Z"
    }
  }
}